benchmark/results/run-20260427-082132/monolith-run1-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/test.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 2m0s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/200 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/200 VUs  0m01.0s/1m30.0s

running (0m02.8s), 001/200 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 001/200 VUs  0m02.0s/1m30.0s

running (0m03.8s), 001/200 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 001/200 VUs  0m03.0s/1m30.0s

running (0m04.8s), 002/200 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 002/200 VUs  0m04.0s/1m30.0s

running (0m05.8s), 002/200 VUs, 5 complete and 0 interrupted iterations
default   [   6% ] 002/200 VUs  0m05.0s/1m30.0s

running (0m06.8s), 002/200 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 002/200 VUs  0m06.0s/1m30.0s

running (0m07.8s), 003/200 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 003/200 VUs  0m07.0s/1m30.0s

running (0m08.8s), 003/200 VUs, 12 complete and 0 interrupted iterations
default   [   9% ] 003/200 VUs  0m08.0s/1m30.0s

running (0m09.8s), 003/200 VUs, 15 complete and 0 interrupted iterations
default   [  10% ] 003/200 VUs  0m09.0s/1m30.0s

running (0m10.8s), 003/200 VUs, 18 complete and 0 interrupted iterations
default   [  11% ] 003/200 VUs  0m10.0s/1m30.0s

running (0m11.8s), 004/200 VUs, 21 complete and 0 interrupted iterations
default   [  12% ] 004/200 VUs  0m11.0s/1m30.0s

running (0m12.8s), 004/200 VUs, 25 complete and 0 interrupted iterations
default   [  13% ] 004/200 VUs  0m12.0s/1m30.0s

running (0m13.8s), 004/200 VUs, 29 complete and 0 interrupted iterations
default   [  14% ] 004/200 VUs  0m13.0s/1m30.0s

running (0m14.8s), 005/200 VUs, 33 complete and 0 interrupted iterations
default   [  16% ] 005/200 VUs  0m14.0s/1m30.0s

running (0m15.8s), 005/200 VUs, 38 complete and 0 interrupted iterations
default   [  17% ] 005/200 VUs  0m15.0s/1m30.0s

running (0m16.8s), 005/200 VUs, 43 complete and 0 interrupted iterations
default   [  18% ] 005/200 VUs  0m16.0s/1m30.0s

running (0m18.1s), 006/200 VUs, 48 complete and 0 interrupted iterations
default   [  19% ] 006/200 VUs  0m17.0s/1m30.0s

running (0m19.1s), 006/200 VUs, 54 complete and 0 interrupted iterations
default   [  20% ] 006/200 VUs  0m18.0s/1m30.0s

running (0m20.1s), 006/200 VUs, 60 complete and 0 interrupted iterations
default   [  21% ] 006/200 VUs  0m19.0s/1m30.0s

running (0m21.1s), 006/200 VUs, 66 complete and 0 interrupted iterations
default   [  22% ] 006/200 VUs  0m20.0s/1m30.0s

running (0m22.1s), 007/200 VUs, 72 complete and 0 interrupted iterations
default   [  23% ] 007/200 VUs  0m21.0s/1m30.0s

running (0m23.1s), 007/200 VUs, 79 complete and 0 interrupted iterations
default   [  24% ] 007/200 VUs  0m22.0s/1m30.0s

running (0m24.1s), 007/200 VUs, 86 complete and 0 interrupted iterations
default   [  26% ] 007/200 VUs  0m23.0s/1m30.0s

running (0m25.1s), 008/200 VUs, 93 complete and 0 interrupted iterations
default   [  27% ] 008/200 VUs  0m24.0s/1m30.0s

running (0m26.1s), 008/200 VUs, 101 complete and 0 interrupted iterations
default   [  28% ] 008/200 VUs  0m25.0s/1m30.0s

running (0m27.1s), 008/200 VUs, 109 complete and 0 interrupted iterations
default   [  29% ] 008/200 VUs  0m26.0s/1m30.0s

running (0m28.1s), 009/200 VUs, 117 complete and 0 interrupted iterations
default   [  30% ] 009/200 VUs  0m27.0s/1m30.0s

running (0m29.1s), 009/200 VUs, 126 complete and 0 interrupted iterations
default   [  31% ] 009/200 VUs  0m28.0s/1m30.0s

running (0m30.1s), 009/200 VUs, 135 complete and 0 interrupted iterations
default   [  32% ] 009/200 VUs  0m29.0s/1m30.0s

running (0m31.1s), 009/200 VUs, 144 complete and 0 interrupted iterations
default   [  33% ] 009/200 VUs  0m30.0s/1m30.0s

running (0m32.1s), 011/200 VUs, 153 complete and 0 interrupted iterations
default   [  34% ] 011/200 VUs  0m31.0s/1m30.0s

running (0m33.1s), 012/200 VUs, 163 complete and 0 interrupted iterations
default   [  36% ] 012/200 VUs  0m32.0s/1m30.0s

running (0m34.1s), 013/200 VUs, 175 complete and 0 interrupted iterations
default   [  37% ] 013/200 VUs  0m33.0s/1m30.0s

running (0m35.1s), 015/200 VUs, 188 complete and 0 interrupted iterations
default   [  38% ] 015/200 VUs  0m34.0s/1m30.0s

running (0m36.1s), 016/200 VUs, 203 complete and 0 interrupted iterations
default   [  39% ] 016/200 VUs  0m35.0s/1m30.0s

running (0m37.1s), 017/200 VUs, 219 complete and 0 interrupted iterations
default   [  40% ] 017/200 VUs  0m36.0s/1m30.0s

running (0m38.1s), 019/200 VUs, 236 complete and 0 interrupted iterations
default   [  41% ] 019/200 VUs  0m37.0s/1m30.0s

running (0m39.1s), 020/200 VUs, 254 complete and 0 interrupted iterations
default   [  42% ] 020/200 VUs  0m38.0s/1m30.0s

running (0m40.1s), 021/200 VUs, 274 complete and 0 interrupted iterations
default   [  43% ] 021/200 VUs  0m39.0s/1m30.0s

running (0m41.1s), 023/200 VUs, 295 complete and 0 interrupted iterations
default   [  44% ] 023/200 VUs  0m40.0s/1m30.0s

running (0m42.1s), 024/200 VUs, 318 complete and 0 interrupted iterations
default   [  46% ] 024/200 VUs  0m41.0s/1m30.0s

running (0m43.1s), 025/200 VUs, 342 complete and 0 interrupted iterations
default   [  47% ] 025/200 VUs  0m42.0s/1m30.0s

running (0m44.1s), 027/200 VUs, 367 complete and 0 interrupted iterations
default   [  48% ] 027/200 VUs  0m43.0s/1m30.0s

running (0m45.1s), 028/200 VUs, 394 complete and 0 interrupted iterations
default   [  49% ] 028/200 VUs  0m44.0s/1m30.0s

running (0m46.1s), 029/200 VUs, 422 complete and 0 interrupted iterations
default   [  50% ] 029/200 VUs  0m45.0s/1m30.0s

running (0m47.1s), 031/200 VUs, 451 complete and 0 interrupted iterations
default   [  51% ] 031/200 VUs  0m46.0s/1m30.0s

running (0m48.8s), 032/200 VUs, 482 complete and 0 interrupted iterations
default   [  52% ] 032/200 VUs  0m47.0s/1m30.0s

running (0m49.8s), 033/200 VUs, 512 complete and 0 interrupted iterations
default   [  53% ] 033/200 VUs  0m48.0s/1m30.0s

running (0m50.8s), 035/200 VUs, 544 complete and 0 interrupted iterations
default   [  54% ] 035/200 VUs  0m49.0s/1m30.0s

running (0m51.8s), 036/200 VUs, 579 complete and 0 interrupted iterations
default   [  56% ] 036/200 VUs  0m50.0s/1m30.0s

running (0m52.8s), 037/200 VUs, 614 complete and 0 interrupted iterations
default   [  57% ] 037/200 VUs  0m51.0s/1m30.0s

running (0m53.8s), 039/200 VUs, 651 complete and 0 interrupted iterations
default   [  58% ] 039/200 VUs  0m52.0s/1m30.0s

running (0m54.8s), 040/200 VUs, 690 complete and 0 interrupted iterations
default   [  59% ] 040/200 VUs  0m53.0s/1m30.0s

running (0m55.8s), 041/200 VUs, 730 complete and 0 interrupted iterations
default   [  60% ] 041/200 VUs  0m54.0s/1m30.0s

running (0m56.8s), 043/200 VUs, 771 complete and 0 interrupted iterations
default   [  61% ] 043/200 VUs  0m55.0s/1m30.0s

running (0m57.8s), 044/200 VUs, 814 complete and 0 interrupted iterations
default   [  62% ] 044/200 VUs  0m56.0s/1m30.0s

running (0m58.8s), 045/200 VUs, 855 complete and 0 interrupted iterations
default   [  63% ] 045/200 VUs  0m57.0s/1m30.0s

running (0m59.8s), 047/200 VUs, 897 complete and 0 interrupted iterations
default   [  64% ] 047/200 VUs  0m58.0s/1m30.0s

running (1m00.8s), 048/200 VUs, 944 complete and 0 interrupted iterations
default   [  66% ] 048/200 VUs  0m59.0s/1m30.0s

running (1m01.8s), 049/200 VUs, 992 complete and 0 interrupted iterations
default   [  67% ] 049/200 VUs  1m00.0s/1m30.0s

running (1m02.8s), 054/200 VUs, 1041 complete and 0 interrupted iterations
default   [  68% ] 054/200 VUs  1m01.0s/1m30.0s

running (1m03.8s), 059/200 VUs, 1095 complete and 0 interrupted iterations
default   [  69% ] 059/200 VUs  1m02.0s/1m30.0s

running (1m04.8s), 064/200 VUs, 1154 complete and 0 interrupted iterations
default   [  70% ] 064/200 VUs  1m03.0s/1m30.0s

running (1m05.8s), 069/200 VUs, 1218 complete and 0 interrupted iterations
default   [  71% ] 069/200 VUs  1m04.0s/1m30.0s

running (1m06.8s), 074/200 VUs, 1287 complete and 0 interrupted iterations
default   [  72% ] 074/200 VUs  1m05.0s/1m30.0s

running (1m07.8s), 079/200 VUs, 1354 complete and 0 interrupted iterations
default   [  73% ] 079/200 VUs  1m06.0s/1m30.0s

running (1m08.8s), 084/200 VUs, 1433 complete and 0 interrupted iterations
default   [  74% ] 084/200 VUs  1m07.0s/1m30.0s

running (1m09.8s), 089/200 VUs, 1516 complete and 0 interrupted iterations
default   [  76% ] 089/200 VUs  1m08.0s/1m30.0s

running (1m10.8s), 094/200 VUs, 1605 complete and 0 interrupted iterations
default   [  77% ] 094/200 VUs  1m09.0s/1m30.0s

running (1m11.8s), 099/200 VUs, 1699 complete and 0 interrupted iterations
default   [  78% ] 099/200 VUs  1m10.0s/1m30.0s

running (1m12.8s), 104/200 VUs, 1797 complete and 0 interrupted iterations
default   [  79% ] 104/200 VUs  1m11.0s/1m30.0s

running (1m13.8s), 109/200 VUs, 1901 complete and 0 interrupted iterations
default   [  80% ] 109/200 VUs  1m12.0s/1m30.0s

running (1m14.8s), 114/200 VUs, 2010 complete and 0 interrupted iterations
default   [  81% ] 114/200 VUs  1m13.0s/1m30.0s

running (1m15.8s), 119/200 VUs, 2121 complete and 0 interrupted iterations
default   [  82% ] 119/200 VUs  1m14.0s/1m30.0s

running (1m16.8s), 124/200 VUs, 2238 complete and 0 interrupted iterations
default   [  83% ] 124/200 VUs  1m15.0s/1m30.0s

running (1m17.8s), 129/200 VUs, 2358 complete and 0 interrupted iterations
default   [  84% ] 129/200 VUs  1m16.0s/1m30.0s

running (1m19.5s), 134/200 VUs, 2487 complete and 0 interrupted iterations
default   [  86% ] 134/200 VUs  1m17.0s/1m30.0s

running (1m20.5s), 139/200 VUs, 2621 complete and 0 interrupted iterations
default   [  87% ] 139/200 VUs  1m18.0s/1m30.0s

running (1m21.5s), 144/200 VUs, 2758 complete and 0 interrupted iterations
default   [  88% ] 144/200 VUs  1m19.0s/1m30.0s

running (1m22.5s), 149/200 VUs, 2902 complete and 0 interrupted iterations
default   [  89% ] 149/200 VUs  1m20.0s/1m30.0s

running (1m23.5s), 154/200 VUs, 3051 complete and 0 interrupted iterations
default   [  90% ] 154/200 VUs  1m21.0s/1m30.0s

running (1m24.5s), 159/200 VUs, 3203 complete and 0 interrupted iterations
default   [  91% ] 159/200 VUs  1m22.0s/1m30.0s

running (1m25.5s), 164/200 VUs, 3358 complete and 0 interrupted iterations
default   [  92% ] 164/200 VUs  1m23.0s/1m30.0s

running (1m26.5s), 169/200 VUs, 3507 complete and 0 interrupted iterations
default   [  93% ] 169/200 VUs  1m24.0s/1m30.0s

running (1m27.5s), 174/200 VUs, 3675 complete and 0 interrupted iterations
default   [  94% ] 174/200 VUs  1m25.0s/1m30.0s

running (1m28.5s), 179/200 VUs, 3849 complete and 0 interrupted iterations
default   [  96% ] 179/200 VUs  1m26.0s/1m30.0s

running (1m29.5s), 184/200 VUs, 4011 complete and 0 interrupted iterations
default   [  97% ] 184/200 VUs  1m27.0s/1m30.0s

running (1m30.5s), 189/200 VUs, 4193 complete and 0 interrupted iterations
default   [  98% ] 189/200 VUs  1m28.0s/1m30.0s

running (1m31.5s), 194/200 VUs, 4376 complete and 0 interrupted iterations
default   [  99% ] 194/200 VUs  1m29.0s/1m30.0s

running (1m32.5s), 199/200 VUs, 4565 complete and 0 interrupted iterations
default   [ 100% ] 199/200 VUs  1m30.0s/1m30.0s

running (1m33.5s), 023/200 VUs, 4763 complete and 0 interrupted iterations
default ↓ [ 100% ] 197/200 VUs  1m30s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration....: avg=4.08ms med=2.7ms min=1.11ms max=493.44ms p(90)=6.89ms p(95)=10.91ms p(99)=23.25ms
    http_req_failed......: 100.00% 19144 out of 19144
    http_reqs............: 19144   204.662187/s

    EXECUTION
    iteration_duration...: avg=1.01s  med=1.01s min=1s     max=1.25s    p(90)=1.02s  p(95)=1.04s   p(99)=1.08s  
    iterations...........: 4786    51.165547/s
    vus..................: 23      min=1              max=199
    vus_max..............: 200     min=200            max=200

    NETWORK
    data_received........: 6.0 MB  64 kB/s
    data_sent............: 3.3 MB  36 kB/s



running (1m33.5s), 000/200 VUs, 4786 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m30s